[
    {
        "project_title": "Miniature AI Robot Scientist (MARS) with Digital Microfluidic Ferrobots",
        "leadership": ["Shun Ye, PhD Candidate", "Dino Di Carlo, Professor at UCLA"],
        "research_scientist": ["Artem Goncharov"], 
        "volunteer": ["Vivek Rajasenan, perform day-to-day designs", "Some undergrad volunteers at Di Carlo Lab are working on day experiments as well."],
        "members_info": "Shun and Dino will be here for the long term; Artem and Vivek will be here at least for one more year.; Shun, Dino, and Artem are funded at least for the future years. Vivek is not funded now."
    },
    {
        "section": "Significance / Unmet Need",
        "question": "What is the unmet need in the market that you are attempting to address? Alternatively, what is the specific problem you are addressing?",
        "content": "Most existing lab automation solutions are expensive, bulky, and only partially automate laboratory workflows. As a result, biotech companies incur excessive R&D expenses, amounting to approximately $250 billion globally in 2023. Personnel costs primarily drive expenses, but the high cost of bioreagents also hinders scaling. This high cost leaves early-stage biotech firms and newly established research labs unable to adopt lab automation solutions, and limits the scale and breadth of experiments. Further, there is a dearth of highly skilled researchers, and the timeline to train a new researcher is approximately 10 years, which will be exacerbated by current funding cuts for scientific research at Universities. For the past 20 years, the concept of Lab-on-a-Chip has aimed to miniaturize bioassays on microfluidic chips, to reduce reagent costs. However, these systems still require specialized expertise to operate and are not automated or integrated with intelligent experiment planning and interpretation that is possible with contemporary multi-modal large language models (LLMs). MARS aims to address these gaps in the lab automation market through its unique features: (i) a compact design that fits entirely on a single lab bench; (ii) hardware costs reduced to one-tenth of conventional lab automation platforms, resulting in more than 95% savings in reagent costs due to support for microvolume assays; (iii) an intuitive AI-driven interface that simplifies the design, execution, and interpretation of bioassays; and (iv) end-to-end execution of bioassays, from sample loading to results analysis. These attributes make MARS an appealing lab automation platform for both large-scale R&D teams and resource-limited labs. As a first bioassay, we aim to automate cell culture, a routine process performed in most life science R&D labs. Currently, the process of repeatedly changing culture media and harvesting cells can take up to several hours per day for researchers, involving multiple manual operational and visual interpretation steps. Some automation platforms, such as Cellmatic from Formulatrix, provide automation of entire cell culturing workflows from preparation to imaging and counting. However, they represent bulky and expensive systems, requiring substantial initial investment and personnel training for operation and maintenance. In addition, such systems lack flexibility, providing limited scalability to novel assay types and non-plate-based vessels. Emerging low-cost systems for automated liquid handling (e.g., Opentrons OT-2) do not provide fully automated cell culture workflows, requiring manual sample transfer and quality control, and exhibit inferior accuracy for low sample volumes (i.e., ≤1 μL), thereby increasing sample and reagent consumption. MARS features a cost-effective benchtop design, an intuitive AI-driven user interface, end-to-end automation capability, and support for sub-microliter volumes, representing a viable alternative to existing lab automation technologies for closed-loop cell culture automation, particularly for early-stage companies and newly established research labs. The substantial workload savings provided by MARS will enable more efficient lab operations and expedite the discovery of new research."
    },
    {
        "section": "Scientific Summary",
        "question": "Summarize the key scientific data / findings that support your approach. Answer with bullet points. Limit to 150 total words.",
        "content": "1) We developed a cost-effective, miniaturized Lab-on-a-3D-Printer (Lo3DP) platform for user-friendly execution of bioassays using ferrofluid (Fig. 1). 2) Lo3DP combines: (i) a motion system with a multifunctional manipulation head; (ii) microfluidic cartridges containing samples, reagents, ferrofluid, and other liquids required for bioassays; (iii) an intuitive user interface for assay design and execution within the cartridge; and (iv) a camera for optical assay readout, allowing for end-to-end automation of bioassays from sample loading to data readout (Fig. 1). 3) Demonstrated key liquid handling procedures on the Lo3DP platform, including transportation, aliquoting, dispensing, mixing, and serial dilutions down to 0.5 µL sample volume (Fig. 2). 4) Demonstrated key bioassays, including detection of breast cancer biomarker BRCA1 using LAMP, and quantification of C-Reactive protein (CRP), a coronary heart disease biomarker, using ELISA (Fig. 3)."
    },
    {
        "section": "End User",
        "question": "Who is the anticipated end user of your technology (e.g., patients, consumers, clinicians, nurses, etc.)? In what context would they use your technology (e.g., diagnosis or treatment of disease X; assist with surgical procedure in setting Y; etc.)?",
        "content": "As a general-purpose intelligent laboratory 'robot scientist', MARS has broad applications in research laboratory settings. The primary end-users in research labs are researchers and lab technicians who are involved in performing bioassays or operating laboratory equipment. MARS can significantly assist these users by automating manual experimental steps such as well plate preparation, pipetting, sample transfer, and data analysis. This automation provides substantial workload savings and enhances the efficiency of lab operations. For example, MARS can automate the entire cell culture process, from cell preparation to imaging and analysis, streamlining the experimental pipeline and significantly improving laboratory efficiency. Ultimately, as MARS capabilities expand, the end users of MARS will be lab directors who can set high-level research goals for MARS to design, execute, and interpret results from these tasks autonomously and iteratively."
    },
    {
        "section": "Standard of Care",
        "question": "Is there a standard of care today for the application or problem you are attempting to address? If so, what is it? If already answered in the original LOI, you have the option here to refine/clarify your answer. Why would your technology be adopted over the standard of care, assuming all technical/developmental hurdles are overcome? For example, your approach might: modify underlying disease vs. treat only symptoms; be safer in a targeted population; be cheaper or faster; be more accurate; etc. Describe any evidence or sources of information that support your position, such as clinical data, patients, clinicians, pharmacists, lab techs, etc.",
        "content": "Although existing products can automate defined research steps, such as cell culture, these systems are often prohibitively expensive, measuring over a million dollars, several meters in length, over 2 meters in height, and weighing over 1 ton, requiring additional structural support and facility modifications for installation. Therefore, substantial initial investment and maintenance are required to incorporate these automation systems into experimental workflows, which prevents their adoption in small and resource-limited laboratory settings. Furthermore, such platforms are typically designed for high-throughput implementation of repetitive tasks, such as cell passaging, relying on fixed well plate formats and established protocols. However, researchers typically prefer flexible, modular systems that can execute more exploratory workflows, enabling iterative revisions of new experiments. More affordable, customizable liquid handling systems, such as Opentrons OT-2, are emerging for automated cell culturing in low-resource settings, also providing custom protocol development via integrated protocol design software or Python. While these platforms are better suited for modular research and resource-limited labs, they have substantial limitations including: (i) no onboard incubator with environmental control (e.g., temperature, humidity), demanding manual transfer of sample trays to/from a separate incubator; (ii) inferior pipetting accuracy at low volumes (i.e., ≤1 uL); (iii) lack of integrated sensors/cameras and software for automated culture quality controls needed for AI-enabled decision making; (iv) software complexity, often requiring custom scripting to generate new assay protocols. Therefore, existing affordable automation platforms have gaps in usability, end-to-end automation capabilities, and support for low sample volumes. MARS addresses the limitations of existing lab automation and liquid handling systems for cell culture, providing a low-cost and compact alternative to conventional platforms. It also promises closed-loop automation of entire experimental protocols and accurate operation down to sub-μL volumes, reducing reagent costs. Specifically, MARS integrates low-cost, custom-designed bioassay hardware (i.e., syringe pump, mini-biobank, mini-spinner, incubator, pipettor, sensor, and camera) into a single, compact platform that fits on a single lab bench. Furthermore, it incorporates a custom motion system that supports a wide range of lab vessels and liquid volumes, down to 0.1 μL. MARS also features an integrated incubator and cameras that communicate with AI-driven software for automated quality control and results interpretation, providing end-to-end automation. Finally, an intuitive user interface with an integrated AI assistant enables the design, implementation, and analysis of cell culture experiments by minimally trained users, providing a standalone implementation of the entire experimental workflow. As a result, MARS fills the gaps in intelligence, size, cost, usability, closed-loop operation, and support for low sample volumes that are present in existing lab automation technologies."
    },
    {
        "section": "Competitive Landscape",
        "question": "What competing technologies, direct or indirect, are currently in development? In what ways does your approach offer an advantage? If already answered in the original LOI, you have the option here to refine/clarify your answer.",
        "content": "Several companies are currently developing hardware platforms for automated liquid handling and sample management, as well as software solutions focused on AI assistants and cloud-based automation for biochemical workflows. Below, we outline key competitors and discuss the advantages of MARS over existing technologies. **Hamilton Robotics** is a major player in the field of automated liquid handling platforms, offering a wide range of automated pipetting and sample management systems. However, their platforms rely on bulky, expensive instruments and require advanced personnel training for operation, which limits their applications to giant biotech companies and centralized clinical settings. In contrast, MARS is an affordable and compact device that fits on a single lab bench, making it an appealing automation platform for research and clinical labs with limited resources. Furthermore, while Hamilton Robotics is well-suited for large-scale repetitive tasks, it lacks flexibility for rapidly evolving protocols within smaller-scale R&D settings. Protocol development and optimization using built-in software often requires custom programming, which limits usability for minimally trained laboratory personnel. MARS offers a user-friendly design and modification of bioassay protocols, enabled by foundation AI models, which facilitate the generation of custom cell culture protocols with minimal user input. **Tecan** offers a diverse array of lab automation solutions, including benchtop-sized modular systems for automating common laboratory assays such as ELISA. However, these platforms necessitate substantial user training for system setup, calibration, and management to adhere to strict maintenance protocols, thus limiting usability. Additionally, despite their modular design, these platforms have limited integration with non-Tecan hardware, such as third-party microbioreactors, which requires custom engineering and restricts scalability. MARS features an intuitive AI-assisted interface that simplifies recalibration and maintenance procedures with minimal user input. Furthermore, MARS has an integrated design that combines all essential hardware components for biochemical experiments within a single setup. Despite its integration, MARS's components can be customized to meet user needs and enhance scalability. **Opentrons** markets benchtop-sized modular liquid handling systems aimed at democratizing lab automation for resource-limited settings. Despite their lower cost compared to high-end liquid handling systems, Opentrons platforms exhibit limited pipetting accuracy, particularly for sub-microliter volumes. Their modular design also restricts capacity, supporting only a limited number of samples and reagents, which affects throughput and scalability for larger-scale experiments. Additionally, Opentrons platforms lack sensors and cameras for real-time monitoring of experiments and automated quality control, necessitating additional user interventions and increasing the risk of experimental errors. Finally, Opentrons software has limited usability, often demanding custom script writing for protocol generation. MARS addresses these limitations by: (i) supporting sub-microliter volumes down to 0.5 µL while maintaining liquid handling accuracy; (ii) integrating a custom incubator that can scale according to different sample numbers; (iii) providing integrated sensors and cameras that communicate with AI-driven software for automated quality control; and (iv) user-friendly generation of bioassay protocols driven by AI LLM models. **Emerald Cloud Lab** offers software-controlled, fully automated bioassay laboratories that enable remote experiment design, execution, and analysis from anywhere in the world. Although this system supports end-to-end lab automation, it is primarily compatible with reagents from its own database and requires standardized sample volumes, which limits flexibility. Additionally, the rent costs are high, starting at approximately $25,000 per month for full access, and the system provides limited transparency during protocol execution and data processing, leading to skepticism about the result outcomes. MARS, as a hardware solution, has a fixed purchase price and can be upgraded over time to newer or higher-throughput versions based on customer needs. It also supports any user-defined reagents within the integrated incubator, allowing users to monitor and control all stages of experimental protocols through an AI-integrated user interface, ensuring transparency in protocol execution and data interpretation. **Potato AI** is a software company developing AI models for the full automation of bioassays. Their platform can generate research hypotheses, refine experimental protocols, and assist with the paper-writing process. However, the lack of an integrated hardware base to perform actual experiments necessitates partnerships with various robotics companies, requiring substantial software modifications for each partner due to differing hardware requirements, which limits flexibility. MARS incorporates hardware components that can implement all steps of bioassays and uses AI models for user-friendly automation of protocol design, execution, and analysis. This integrated approach allows both hardware and software to scale according to different assay types and sample throughputs, thereby enhancing the flexibility of our platform. There are other competing companies in the lab automation market, such as Formulatrix, Tetsuwan Scientific, and Lila Sciences, but they share similar constraints to those discussed above. Thus, current automation platforms often fall short in addressing the diverse needs of the market."
    },
    {
        "section": "Known Risks",
        "question": "What are some foreseeable challenges that might delay the execution of this project (i.e., within the next 18 months in the Innovation Fund)? Please focus on factors outside scientific setbacks that would impact the project (e.g., access to equipment/materials/tissue samples, etc.) Limit to 250 words.",
        "content": "N/A"
    },
    {
        "section": "Alternative Applications",
        "question": ["Independent of any data you may have generated, are you aware of any secondary disease area(s) or market(s) that would be a natural extension for your technology? Limit to 100 words.", "If you have generated any data in the secondary disease area(s) or market(s) noted above, briefly describe the stage of development reached for the secondary disease area(s) or market(s). Limit to 100 words.", "If you have generated any data in the secondary disease area(s) or market(s) noted above, briefly describe the stage of development reached for the secondary disease area(s) or market(s). Limit to 100 words."],
        "content": ["Clinical labs represent a substantial segment of the lab automation market. In clinical labs, diagnostics are typically performed on bulky, expensive chemical analyzers that require highly trained medical personnel to operate, making them inaccessible in resource-limited and point-of-care settings, such as rural clinics, emergency departments, primary care centers, and nursing homes. As a result, diagnostics in these environments often require sample transfer to a central laboratory, which increases the sample-to-answer time, lowers operational throughput, and delays diagnostic outcomes. Benefitting from its low-cost and compact design, MARS can also serve as an affordable diagnostic tool in resource-limited clinical lab settings.", "We have successfully demonstrated the ability to use our system to diagnose HF through CRP and NT-ProBNP concentration measurements. We achieved similar results with standard results, with R^2 > 0.96, using a fully automated process.", "We have successfully demonstrated the ability to use our system to diagnose HF through CRP and NT-ProBNP concentration measurements. We achieved similar results with standard results, with R^2 > 0.96, using a fully automated process."]
    },
    {
        "section": "Proposed Development Milestones",
        "question": "Propose 1 to 5 key milestones that you feel should be part of this development plan to reach an inflection point that increases outside interest in your technology. Include estimated costs for each milestone up to the $150k target award amount. **Prior to receiving UCLA Innovation Fund support, a development plan will be created with you. Milestones are subject to change based on feedback from external investors, consultants, entrepreneurs, industry contacts, and the UCLA Innovation Fund team. For each proposed milestone (bullet points are preferred; 50 words max for each sub-question below): Page 5 of 9; I. Objective: II. What decision does the milestone inform, if any? III. Method/Approach for Achieving Milestones; IV. Estimated timeline. V. Estimated total cost. Note: Faculty salary is not supported; do not provide a detailed, line-item budget, as milestones are subject to change",
        "content": [
            {
                "milestone": "Development Milestone 1",
                "objective": "Develop peripheral components of 1st MARS prototype: complete the automated mini-biobank that stores and manages samples, the automated decapper that opens the tube lids, and the automated mini-incubator that can shake and maintain constant temperature for cell growth.",
                "decision_informed": "Whether the prototype meets technical requirements to justify additional development",
                "approach": "Hire an electrical engineering intern and purchase necessary parts. Test the system control for all electromechanical components to ensure that every individual component functions properly. Demonstrate a fully automated liquid handling process for the hardware from sample retrieval to incubation without using cells, and without aid from LLMs.",
                "estimated_timeline": "6 months",
                "estimated_total_cost": "$30k"
            },
            {
                "milestone": "Development Milestone 2",
                "objecive": "Integrate AI LLMs into MARS. Enable MARS's ability for scientific reasoning and interpreting images and results. Enable access to search online information and papers.",
                "decision_informed": "Decide if the product is acceptable to end-users and worth refining",
                "approach": "Verifying the LLMs' ability to interpret images of cell growth, errors, etc, and how MARS will generate protocols to control the hardware.",
                "estimated_timeline": "3 months (The 9th month)",
                "estimated_total_cost": "$30k"
            },
            {
                "milestone": "Development Milestone 3",
                "objective": "Demonstrate the generation of basic experimental protocols by the integrated AI LLMs",
                "decision_informed": "Decide if performance meets minimum requirements for the target market",
                "approach": "Design different kinds of prompts and generate cell culture protocols, have experts read and manually test if the cell line can be maintained by following the protocols",
                "estimated_timeline": "3 months (The 12th month)",
                "estimated_total_cost": "$30k"
            },
            {
                "milestone": "Development Milestone 4",
                "objective": "Perform end-to-end cell culture experiments using the HEK cell line.",
                "decision_informed": "Decide if technology can be scaled up for commercial production",
                "approach": "Test the functionality of all hardware and software of the MARS for all-in-one, end-to-end cell culture from experimental design to result interpretation. Verify that the cell line can be maintained for at least 4 weeks without requiring manual intervention.",
                "estimated_timeline": "3 months (The 15th month)",
                "estimated_total_cost": "$30k"
            },
            {
                "milestone": "Development Milestone 5",
                "objective": "Perform end-to-end recombinant protein production using the cell culture system and pipeline.",
                "decision_informed": "Whether the performance is competitive enough to pursue partnerships or investor engagement.",
                "approach": "Test and optimize the hardware and software workflow for recombinant protein production. Test using fluorescent protein production for the easy identification and quantification of recombinant protein production. Verify if the entire workflow, from experimental design to result interpretation (based on fluorescent signals), is accurate.",
                "estimated_timeline": "3 months (The 18th month)",
                "estimated_total_cost": "$30k"
            }
        ]
    }
]